___

<a href='https://www.linkedin.com/in/apoorvadogra/'><img src='AD Logo.png'/></a>
___
<center><em>Python Quick Guide By Apoorva Dogra</em></center>

Numbers

# Numbers and more in Python!

    1.) Types of Numbers in Python
    2.) Basic Arithmetic
    3.) Differences between classic division and floor division
    4.) Object Assignment in Python

## Types of numbers

Python has various "types" of numbers such as integers and floating point numbers.

Integers are just whole numbers, positive or negative. For example: 2 and -2 are examples of integers.

Floating point numbers in Python are notable because they have a decimal point in them, or use an exponential (e) to define the number. For example 2.0 and -2.1 are examples of floating point numbers. 4E2 (4 times 10 to the power of 2) is also an example of a floating point number in Python.

<table>
<tr>
    <th>Examples</th> 
    <th>Number "Type"</th>
</tr>

<tr>
    <td>1,2,-5,1000</td>
    <td>Integers</td> 
</tr>

<tr>
    <td>3.2,-0.8,2e4,2E2</td> 
    <td>Floating-point numbers</td> 
</tr>
 </table>

### Basic Arithmetic

In [1]:
# Addition
2+1

3

In [2]:
# Subtraction
2-1

1

In [3]:
# Multiplication
2*2

4

In [4]:
# Division
3/2

1.5

In [2]:
# Floor Division
7//4

1

In [1]:
# Swapping numbers

x=5
y=7
z=x  #5
x=y  #7
y=z 
print(x)
print(y)

7
5

In [2]:
# Swapping numbers without introducing third variable

x=5
y=7
my_dic={x:y,y:x}
print(my_dic[x])
print(my_dic[y])

7
5

In [3]:
# check even and compare

n=30
if n%2==1:
    print("Weird")
elif n%2==0 and 2<n>5:
    print("Not Weird")
elif n%2==0 and 6<n>20:
    print("Weird")
else:
    print("Not Weird")

Not Weird

In [4]:
# Sum

a=3
b=2
SUM=a+b
print(SUM)

5

In [9]:
# squares 
i=0
n=10
i<n
for i in range(0,n):
    print(i**2)

0
1
4
9
16
25
36
49
64
81

In [157]:
# leap year

year=2020
if year%400==0:
        print(True)
elif year%100==0:
        print(False)
elif year%4==0:
        print(True)
else :
        print(False)

True

In [167]:
n=1,5,2,3,6,5

In [ ]:
if __name__ == '__main__':
    n = int(input())
    arr = map(int, input().split())
print(sorted(n)[-2])

In [5]:
# print arr

for i in range(0,x+1):
    for j in range(0,y+1):
        for k in range(0,z+1):
            if (i+j+k)!=n:
                arr.append([i,j,k])
    print(arr)

[0, 0, 0]
[0, 0, 1]
[0, 0, 2]

[0, 1, 0]
[0, 1, 1]


[1, 0, 0]
[1, 0, 1]

[1, 1, 0]
[1, 1, 2]

In [10]:
# print numbers

n=19
for i in range(1, n+1):
    print(i)

1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19

In [96]:
# swap varia

x=5
y=7
y=x+y
x=y-x
y=y-x

print(x)
print(y)

7
5

In [6]:
# Modulo
7%4

3

### Arithmetic continued

In [7]:
# Powers
2**3

8

In [8]:
# Can also do roots this way
4**0.5

2.0

In [9]:
# Order of Operations followed in Python
2 + 10 * 10 + 3

105

In [10]:
# Can use parentheses to specify orders
(2+10) * (10+3)

156

## Variable Assignments

Now that we've seen how to use numbers in Python as a calculator let's see how we can assign names and create variables.

We use a single equals sign to assign labels to variables. Let's see a few examples of how we can do this.

In [11]:
# Let's create an object called "a" and assign it the number 5
a = 5

Now if I call *a* in my Python script, Python will treat it as the number 5.

In [12]:
# Adding the objects
a+a

10

What happens on reassignment? Will Python let us write it over?

In [13]:
# Reassignment
a = 10

In [14]:
# Check
a

10

Yes! Python allows you to write over assigned variable names. We can also use the variables themselves when doing the reassignment. Here is an example of what I mean:

In [15]:
# Check
a

10

In [16]:
# Use A to redefine A
a = a + a

In [17]:
# Check 
a

20

In [1]:
10/(5+2j)

(1.7241379310344829-0.6896551724137931j)

In [15]:
for i in range(1,6):
    for j in range(1,6):
        print((i,j),end='')
    print()

(1, 1)(1, 2)(1, 3)(1, 4)(1, 5)
(2, 1)(2, 2)(2, 3)(2, 4)(2, 5)
(3, 1)(3, 2)(3, 3)(3, 4)(3, 5)
(4, 1)(4, 2)(4, 3)(4, 4)(4, 5)
(5, 1)(5, 2)(5, 3)(5, 4)(5, 5)

## Dynamic Typing

In [15]:
a_bc = 4

In [16]:
a_bc = [ 'Frank' , 'Anna']

## Variable assignment

In [26]:
x=2

In [27]:
x

2

In [28]:
x+x

4

In [29]:
x= x+10

In [30]:
x

12

In [31]:
x+=10

In [32]:
x

22

In [34]:
x*=10

In [35]:
x

220

## Type of variable

In [36]:
type(x)

int

In [37]:
type(a_bc)

list

In [38]:
a = (1,2,3,4)

In [39]:
type(a)

tuple

## String formation

In [40]:
"Hello World!"

'Hello World!'

In [41]:
"It's great working here."

"It's great working here."

In [42]:
print("Hello World!")

Hello World!

In [47]:
#(\n works as enter)
print("It's great working here \n in this company")

It's great working here
 in this company

In [49]:
#Check length of the string (space would be counted in the length)
len("Hello World!")

12

## Indexing
[Start: Stop: Step]

In [50]:
a="Hello World"

In [51]:
a

'Hello World'

In [52]:
a[0]

'H'

In [53]:
a[-1]

'd'

In [54]:
a[0:]

'Hello World'

In [55]:
a[1:]

'ello World'

In [56]:
a[:1]

'H'

In [57]:
a[:3]

'Hel'

In [58]:
a[-1:]

'd'

In [59]:
a[:-1]

'Hello Worl'

In [61]:
a[0:3]

'Hel'

In [62]:
a[::1]

'Hello World'

In [63]:
a[::2]

'HloWrd'

In [65]:
a[1::2]

'el ol'

In [66]:
a[::-1]

'dlroW olleH'

## String concatenation

In [68]:
a + " I am here"

'Hello World I am here'

In [69]:
print(a)

Hello World

In [70]:
a=a + " I am here"

In [71]:
print(a)

Hello World I am here

## String properties

In [72]:
a.upper()

'HELLO WORLD I AM HERE'

In [73]:
a.lower()

'hello world i am here'

In [75]:
a.split()

['Hello', 'World', 'I', 'am', 'here']

In [77]:
a.split('r')

['Hello Wo', 'ld I am he', 'e']

## Print Formatting

 %s stands for str() and %r stands for repr(), string representation.
 \t inserts tab
 and %d converts numbers to intergers without rounding.

In [3]:
print("In order to add %s here and %s here." %('something', 'another'))

In order to add something here and another here.

In [4]:
x,y = 'something' , 'another'
print("In order to add %s here and %s here." %(x,y))

In order to add something here and more here.

In [6]:
print("She told that her name was %s." %'Jane')
print("She told that her name was %r." %'Jane')

She told that her name was Jane.
She told that her name was 'Jane'.

In [9]:
print('He scored %s marks in first semester.' %3.75)
print('He scored %d marks in first semester.' %3.75)

He scored 3.75 marks in first semester.
He scored 3 marks in first semester.

## Multiple formating

In [1]:
print('First: %s, Second: %5.2f, Third: %r' %('hi!',3.1415,'bye!'))

First: hi!, Second:  3.14, Third: 'bye!'

## Formatting with the `.format()` method
A better way to format objects into your strings for print statements is with the string `.format()` method. The syntax is:

    'String here {} then also {}'.format('something1','something2')
    
For example:

In [13]:
print('This is a string with an {}'.format('insert'))

This is a string with an insert

### The .format() method has several advantages over the %s placeholder method:

#### 1. Inserted objects can be called by index position:

In [14]:
print('The {2} {1} {0}'.format('fox','brown','quick'))

The quick brown fox

#### 2. Inserted objects can be assigned keywords:

In [4]:
print('First Object: {a}, Second Object: {b}, Third Object: {c}'.format(a=1,b='Two',c=12.3))

First Object: 1, Second Object: Two, Third Object: 12.3

#### 3. Inserted objects can be reused, avoiding duplication:

In [16]:
print('A %s saved is a %s earned.' %('penny','penny'))
# vs.
print('A {p} saved is a {p} earned.'.format(p='penny'))

A penny saved is a penny earned.
A penny saved is a penny earned.

### Alignment, padding and precision with `.format()`
Within the curly braces you can assign field lengths, left/right alignments, rounding parameters and more

In [17]:
print('{0:8} | {1:9}'.format('Fruit', 'Quantity'))
print('{0:8} | {1:9}'.format('Apples', 3.))
print('{0:8} | {1:9}'.format('Oranges', 10))

Fruit    | Quantity
Apples   |       3.0
Oranges  |        10

By default, `.format()` aligns text to the left, numbers to the right. You can pass an optional `<`,`^`, or `>` to set a left, center or right alignment:

In [18]:
print('{0:<8} | {1:^8} | {2:>8}'.format('Left','Center','Right'))
print('{0:<8} | {1:^8} | {2:>8}'.format(11,22,33))

Left     |  Center  |    Right
11       |    22    |       33

## NUMPY

In [8]:
import numpy as np

## PANDAS

In [2]:
# installing pandas
! pip install pandas

Requirement already satisfied: pandas in c:\users\dogra\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\dogra\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\dogra\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\dogra\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\dogra\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import pandas as pd

In [27]:
 #create list
book_title=['C++','Java','Python','Javascript']

In [28]:
#create series from the list  
book_title=pd.Series(book_title,index = ['a','b','c','d']) #(S capital)
book_title

a           C++
b          Java
c        Python
d    Javascript
dtype: object

In [12]:
type(book_title)

pandas.core.series.Series

In [13]:
#Indexxing
book_title[2]

'Python'

In [29]:
book_title.index=['a','b','c','d']

In [30]:
book_title

a           C++
b          Java
c        Python
d    Javascript
dtype: object

In [31]:
book_title['c']

'Python'

# Dataframe

2D array

In [4]:
#import numpy
import numpy as np

In [41]:
#forming random array
arr=np.random.randint(10, 100, size=(6,4))

In [42]:
arr

array([[40, 37, 77, 34],
       [32, 31, 72, 85],
       [43, 17, 74, 92],
       [16, 38, 13, 24],
       [54, 89, 62, 62],
       [46, 48, 55, 54]])

In [45]:
df=pd.DataFrame(data=arr)   # D & F capital
df

    0   1   2   3
0  40  37  77  34
1  32  31  72  85
2  43  17  74  92
3  16  38  13  24
4  54  89  62  62
5  46  48  55  54

In [46]:
type(df)

pandas.core.frame.DataFrame

In [49]:
df[2]

0    77
1    72
2    74
3    13
4    62
5    55
Name: 2, dtype: int32

In [50]:
type(df[2])

pandas.core.series.Series

In [52]:
df.columns=['A','B','C','D']
df

    A   B   C   D
0  40  37  77  34
1  32  31  72  85
2  43  17  74  92
3  16  38  13  24
4  54  89  62  62
5  46  48  55  54

In [53]:
df.shape

(6, 4)

In [54]:
df.head()

    A   B   C   D
0  40  37  77  34
1  32  31  72  85
2  43  17  74  92
3  16  38  13  24
4  54  89  62  62

In [55]:
df.head(n=3)

    A   B   C   D
0  40  37  77  34
1  32  31  72  85
2  43  17  74  92

In [56]:
df.tail()

    A   B   C   D
1  32  31  72  85
2  43  17  74  92
3  16  38  13  24
4  54  89  62  62
5  46  48  55  54

In [57]:
df.tail(n=3)

    A   B   C   D
3  16  38  13  24
4  54  89  62  62
5  46  48  55  54

In [62]:
#cols=['A','B']
#df[cols] or

df[['A','B']]

    A   B
0  40  37
1  32  31
2  43  17
3  16  38
4  54  89
5  46  48

In [63]:
df[['B','A']]

    B   A
0  37  40
1  31  32
2  17  43
3  38  16
4  89  54
5  48  46

In [64]:
#aad new column
df['A+B']=df['A']+df['B']

In [65]:
df

    A   B   C   D  A+B
0  40  37  77  34   77
1  32  31  72  85   63
2  43  17  74  92   60
3  16  38  13  24   54
4  54  89  62  62  143
5  46  48  55  54   94

In [67]:
df['A-B']=df['A']*df['B']
df

    A   B   C   D  A+B   A-B
0  40  37  77  34   77  1480
1  32  31  72  85   63   992
2  43  17  74  92   60   731
3  16  38  13  24   54   608
4  54  89  62  62  143  4806
5  46  48  55  54   94  2208

In [73]:
#delete column 
df=df.drop(columns=['A-B']) # or df.drop(columns=['A-B'], inplace=True) to modify the dataframe

In [74]:
df

    A   B   C   D  A+B
0  40  37  77  34   77
1  32  31  72  85   63
2  43  17  74  92   60
3  16  38  13  24   54
4  54  89  62  62  143
5  46  48  55  54   94

In [75]:
df.loc[4]

A       54
B       89
C       62
D       62
A+B    143
Name: 4, dtype: int32

In [76]:
df.index="p q r s t u".split()

In [77]:
df

    A   B   C   D  A+B
p  40  37  77  34   77
q  32  31  72  85   63
r  43  17  74  92   60
s  16  38  13  24   54
t  54  89  62  62  143
u  46  48  55  54   94

In [79]:
df.loc['p']

A      40
B      37
C      77
D      34
A+B    77
Name: p, dtype: int32

In [80]:
#iloc=integer location
df.iloc[4]

A       54
B       89
C       62
D       62
A+B    143
Name: t, dtype: int32

In [82]:
df.iloc[2:5]

    A   B   C   D  A+B
r  43  17  74  92   60
s  16  38  13  24   54
t  54  89  62  62  143

In [83]:
df.iloc[2:5][['A','B']]

    A   B
r  43  17
s  16  38
t  54  89

In [84]:
df.iloc[-2:][['D','A+B']]

    D  A+B
t  62  143
u  54   94

In [85]:
df.iloc[-2:,-2:]

    D  A+B
t  62  143
u  54   94

## Masking Boolean Indexing

In [86]:
df

    A   B   C   D  A+B
p  40  37  77  34   77
q  32  31  72  85   63
r  43  17  74  92   60
s  16  38  13  24   54
t  54  89  62  62  143
u  46  48  55  54   94

In [89]:
mask=df>30
mask

       A      B      C      D   A+B
p   True   True   True   True  True
q   True   True   True   True  True
r   True  False   True   True  True
s  False   True  False  False  True
t   True   True   True   True  True
u   True   True   True   True  True

In [90]:
df[mask]

      A     B     C     D  A+B
p  40.0  37.0  77.0  34.0   77
q  32.0  31.0  72.0  85.0   63
r  43.0   NaN  74.0  92.0   60
s   NaN  38.0   NaN   NaN   54
t  54.0  89.0  62.0  62.0  143
u  46.0  48.0  55.0  54.0   94

In [91]:
df[df>30]

      A     B     C     D  A+B
p  40.0  37.0  77.0  34.0   77
q  32.0  31.0  72.0  85.0   63
r  43.0   NaN  74.0  92.0   60
s   NaN  38.0   NaN   NaN   54
t  54.0  89.0  62.0  62.0  143
u  46.0  48.0  55.0  54.0   94

In [95]:
mask=df['B']>40
mask

p    False
q    False
r    False
s    False
t     True
u     True
Name: B, dtype: bool

In [96]:
df[mask]

    A   B   C   D  A+B
t  54  89  62  62  143
u  46  48  55  54   94

In [100]:
df[df['B']>40][['C','D']]

    C   D
t  62  62
u  55  54

In [101]:
df['A']>40

p    False
q    False
r     True
s    False
t     True
u     True
Name: A, dtype: bool

In [102]:
df['D']<50

p     True
q    False
r    False
s     True
t    False
u    False
Name: D, dtype: bool

In [105]:
(df['A']>40) & (df['D']<1000)

p    False
q    False
r     True
s    False
t     True
u     True
dtype: bool

In [106]:
df[(df['A']>40) & (df['D']<100)]

    A   B   C   D  A+B
r  43  17  74  92   60
t  54  89  62  62  143
u  46  48  55  54   94

In [107]:
df.values

array([[ 40,  37,  77,  34,  77],
       [ 32,  31,  72,  85,  63],
       [ 43,  17,  74,  92,  60],
       [ 16,  38,  13,  24,  54],
       [ 54,  89,  62,  62, 143],
       [ 46,  48,  55,  54,  94]])

## Iris Dataset

In [5]:
!ls

'ls' is not recognized as an internal or external command,
operable program or batch file.

In [6]:
iris=pd.read_csv("./iris.csv")

In [7]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [119]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [120]:
iris.shape

(150, 5)

In [121]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [122]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [123]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [124]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [125]:
iris['species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [127]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [128]:
iris['species'].nunique()

3

In [130]:
iris[iris['species']=='setosa']

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa
20           5.4          3.4           1.7          0.2  setosa
21           5.1          3.7           1.5          0.4  setosa
22           4.6          3.6           1.0          0.2  setosa
23           5.1          3.3           1.7          0.5  setosa
24           4.8          3.4           1.9          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa
26           5.0          3.4           1.6          0.4  setosa
27           5.2          3.5           1.5          0.2  setosa
28           5.2          3.4           1.4          0.2  setosa
29           4.7          3.2           1.6          0.2  setosa
30           4.8          3.1           1.6          0.2  setosa
31           5.4          3.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa
34           4.9          3.1           1.5          0.1  setosa
35           5.0          3.2           1.2          0.2  setosa
36           5.5          3.5           1.3          0.2  setosa
37           4.9          3.1           1.5          0.1  setosa
38           4.4          3.0           1.3          0.2  setosa
39           5.1          3.4           1.5          0.2  setosa
40           5.0          3.5           1.3          0.3  setosa
41           4.5          2.3           1.3          0.3  setosa
42           4.4          3.2           1.3          0.2  setosa
43           5.0          3.5           1.6          0.6  setosa
44           5.1          3.8           1.9          0.4  setosa
45           4.8          3.0           1.4          0.3  setosa
46           5.1          3.8           1.6          0.2  setosa
47           4.6          3.2           1.4          0.2  setosa
48           5.3          3.7           1.5          0.2  setosa
49           5.0          3.3           1.4          0.2  setosa

In [131]:
iris[iris['species']=='setosa'].shape

(50, 5)

In [132]:
iris['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [133]:
iris['species'].value_counts()['virginica']

50

In [134]:
iris['sepal_length'].mean()

5.843333333333335

In [135]:
iris['petal_width'].max()

2.5

In [136]:
iris['petal_width'].min()

0.1

In [137]:
iris['petal_width'].sum()

179.8

In [138]:
iris['petal_width']

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: petal_width, Length: 150, dtype: float64

In [142]:
iris.sort_values(by=['sepal_length','sepal_width'])

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
8             4.4          2.9           1.4          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
42            4.4          3.2           1.3          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

## Grouping data

In [147]:
iris['species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [4]:
len('setosa')

6

In [149]:
iris['species'].apply(len)

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [150]:
iris.apply(lambda x : x+x)

     sepal_length  sepal_width  petal_length  petal_width             species
0            10.2          7.0           2.8          0.4        setosasetosa
1             9.8          6.0           2.8          0.4        setosasetosa
2             9.4          6.4           2.6          0.4        setosasetosa
3             9.2          6.2           3.0          0.4        setosasetosa
4            10.0          7.2           2.8          0.4        setosasetosa
..            ...          ...           ...          ...                 ...
145          13.4          6.0          10.4          4.6  virginicavirginica
146          12.6          5.0          10.0          3.8  virginicavirginica
147          13.0          6.0          10.4          4.0  virginicavirginica
148          12.4          6.8          10.8          4.6  virginicavirginica
149          11.8          6.0          10.2          3.6  virginicavirginica

[150 rows x 5 columns]

In [152]:
iris.aggregate('min')

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [153]:
iris.aggregate(['min','max','mean','median'])

C:\Users\dogra\AppData\Local\Temp\ipykernel_16824\214860762.py:1: FutureWarning: ['species'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  iris.aggregate(['min','max','mean','median'])

        sepal_length  sepal_width  petal_length  petal_width    species
min         4.300000        2.000      1.000000     0.100000     setosa
max         7.900000        4.400      6.900000     2.500000  virginica
mean        5.843333        3.054      3.758667     1.198667        NaN
median      5.800000        3.000      4.350000     1.300000        NaN

In [155]:
groupby=iris.groupby('species')
groupby

In [156]:
groupby.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [157]:
groupby.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.418         1.464        0.244
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [162]:
iris[ iris['species']=='setosa']['sepal_length'].mean()

5.005999999999999

In [163]:
groupby.count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [164]:
groupby.sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        170.9          73.2         12.2
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3

In [165]:
groupby.describe()

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.418  ...        1.575  1.9        50.0  0.244
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.107210  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

In [166]:
groupby.describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.418000    2.770000   2.974000
             std     0.381024    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.125000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.464000    4.260000   5.552000
             std     0.173511    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.244000    1.326000   2.026000
             std     0.107210    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

## Missing Data

In [8]:
iris=pd.read_csv('./iris.csv')

In [9]:
import warnings
warnings.filterwarnings('ignore')

In [10]:
nan_idx=np.random.randint(0,150,20)
iris['sepal_length'][nan_idx]=np.nan

In [192]:
iris['sepal_length'][:50]

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    NaN
14    NaN
15    5.7
16    NaN
17    5.1
18    5.7
19    NaN
20    5.4
21    5.1
22    NaN
23    5.1
24    NaN
25    5.0
26    5.0
27    5.2
28    NaN
29    4.7
30    4.8
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    NaN
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [193]:
nan_idx=np.random.randint(0,150,15)
iris['petal_width'][nan_idx]=np.nan

In [194]:
iris['petal_width']

0      0.2
1      0.2
2      NaN
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: petal_width, Length: 150, dtype: float64

In [195]:
iris.isna().sum()

sepal_length    20
sepal_width      0
petal_length     0
petal_width     14
species          0
dtype: int64

In [188]:
#iris.dropna()

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
149           5.9          3.0           5.1          1.8  virginica

[119 rows x 5 columns]

In [198]:
iris['sepal_length'].fillna(value='FILLTHIS')[:50]

0          5.1
1          4.9
2          4.7
3          4.6
4          5.0
5          5.4
6          4.6
7          5.0
8          4.4
9          4.9
10         5.4
11         4.8
12         4.8
13    FILLTHIS
14    FILLTHIS
15         5.7
16    FILLTHIS
17         5.1
18         5.7
19    FILLTHIS
20         5.4
21         5.1
22    FILLTHIS
23         5.1
24    FILLTHIS
25         5.0
26         5.0
27         5.2
28    FILLTHIS
29         4.7
30         4.8
31         5.4
32         5.2
33         5.5
34         4.9
35         5.0
36         5.5
37         4.9
38         4.4
39         5.1
40         5.0
41         4.5
42         4.4
43         5.0
44    FILLTHIS
45         4.8
46         5.1
47         4.6
48         5.3
49         5.0
Name: sepal_length, dtype: object

In [203]:
iris['sepal_length']=iris['sepal_length'].fillna(value= round(iris['sepal_length'].mean(),1))

In [200]:
round(iris['sepal_length'].mean(),1)

5.9

In [206]:
iris['sepal_length'][:50]

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    5.9
14    5.9
15    5.7
16    5.9
17    5.1
18    5.7
19    5.9
20    5.4
21    5.1
22    5.9
23    5.1
24    5.9
25    5.0
26    5.0
27    5.2
28    5.9
29    4.7
30    4.8
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.9
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [207]:
iris['petal_length'][:50]

0     1.4
1     1.4
2     1.3
3     1.5
4     1.4
5     1.7
6     1.4
7     1.5
8     1.4
9     1.5
10    1.5
11    1.6
12    1.4
13    1.1
14    1.2
15    1.5
16    1.3
17    1.4
18    1.7
19    1.5
20    1.7
21    1.5
22    1.0
23    1.7
24    1.9
25    1.6
26    1.6
27    1.5
28    1.4
29    1.6
30    1.6
31    1.5
32    1.5
33    1.4
34    1.5
35    1.2
36    1.3
37    1.5
38    1.3
39    1.5
40    1.3
41    1.3
42    1.3
43    1.6
44    1.9
45    1.4
46    1.6
47    1.4
48    1.5
49    1.4
Name: petal_length, dtype: float64

## Concatenate & Merge DataFrames

In [11]:
new_df= pd.DataFrame(np.random.randint(0, 7, size=(10,4)))
new_df

   0  1  2  3
0  4  4  2  0
1  1  2  4  5
2  1  0  3  4
3  0  2  6  4
4  3  0  1  6
5  0  0  5  0
6  4  5  5  4
7  0  4  6  4
8  1  2  1  0
9  4  1  2  0

In [13]:
new_df['species']='new_species'

In [14]:
new_df.head()

   0  1  2  3      species
0  4  4  2  0  new_species
1  1  2  4  5  new_species
2  1  0  3  4  new_species
3  0  2  6  4  new_species
4  3  0  1  6  new_species

In [15]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [16]:
new_df.columns=iris.columns

In [17]:
new_df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0             4            4             2            0  new_species
1             1            2             4            5  new_species
2             1            0             3            4  new_species
3             0            2             6            4  new_species
4             3            0             1            6  new_species

In [20]:
iris=pd.concat((iris, new_df), axis=0)

In [21]:
iris.shape

(160, 5)

## Merging Dataframe

In [22]:
df1= pd.DataFrame({'S_Name':['Mohit','Jatin','Prateek','Mohit'],'CGPA':[2,4,5,3]})

In [23]:
df1

    S_Name  CGPA
0    Mohit     2
1    Jatin     4
2  Prateek     5
3    Mohit     3

In [24]:
df2=pd.DataFrame({'T Name':['Mohit','Jatin','Prateek','Mohit'],'CGPA':[3,6,8,9]})

In [25]:
df2

    T Name  CGPA
0    Mohit     3
1    Jatin     6
2  Prateek     8
3    Mohit     9

In [26]:
df1.merge(df2, how='inner')

  S_Name  CGPA T Name
0  Mohit     3  Mohit

In [27]:
df1.merge(df2, how='left')

    S_Name  CGPA T Name
0    Mohit     2    NaN
1    Jatin     4    NaN
2  Prateek     5    NaN
3    Mohit     3  Mohit

In [28]:
df1.merge(df2, how='right')

  S_Name  CGPA   T Name
0  Mohit     3    Mohit
1    NaN     6    Jatin
2    NaN     8  Prateek
3    NaN     9    Mohit

In [29]:
df1.merge(df2, how='outer')

    S_Name  CGPA   T Name
0    Mohit     2      NaN
1    Jatin     4      NaN
2  Prateek     5      NaN
3    Mohit     3    Mohit
4      NaN     6    Jatin
5      NaN     8  Prateek
6      NaN     9    Mohit

## Output files

In [33]:
iris.to_csv('./modified_iris_csv', index=False)

In [35]:
modified_iris=pd.read_csv('./modified_iris_csv')

In [36]:
modified_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [37]:
iris.to_excel("./new_iris.xlsx", sheet_name="iris sheet")